## Repaso Victor Marinas 

## Python:

El dataset `BlackFriday.csv` contiene 550.000 registros sobre las ventas realizadas en un comercio. Cada registro contiene información del cliente (sexo, si está casado o no, edad, etc.) e información de la compra que ha realizado en el comercio (importe de la compra, tipo de producto, etc.).

* `User_ID`                : Código de usuario
* `Product_ID`             : Código de producto
* `Sexo`                   : Hombre(M), Mujer(F)
* `Edad`                   : Franja de edad del usuario
* `Occupation`              
* `Cat_ciudad`             : Categoría de la ciudad de residencia del usuario
* `Years_en _la_ciudad`    : Número de años que el usario lleva residiendo en la ciudad
* `Estado_civil`           : Casado(1), soltero(0)
* `Product_Category_1`       : Categoría 1 del producto 
* `Product_Category_2`     : Categoría 2 del producto
* `Product_Category_3`     : Categoría 3 del producto
* `Imp_Compra`             : Importe o precio del producto

Por otro lado, el dataset `BlackFriday_Products.xlsx` contiene la descripción de cada uno de los productos junto con su valoración en un rango del 1 al 5.

* `Product`                : Código de producto
* `Descripción`            : Descripción del producto
* `average_product_rating` : valoración media del producto en un rango del 1 al 5


Carga los datos de los datasets  `BlackFriday.csv` y `BlackFriday_Products.xlsx` en dos dataframes llamados `ventas` y `productos` respectivamente.

In [1]:
# Carga de los datasets

#  pd.read_csv, pd.read_excel o pd.read_table : PARA CREAR UN __DF__


import pandas as pd
import numpy as np

ventas = pd.read_csv('BlackFriday.csv')
productos = pd.read_excel('BlackFriday_Products.xlsx')

# Funcion .HEAD

In [2]:
ventas.head(5)

,User_ID,Product_ID,Sexo,Edad,Occupation,Cat_ciudad,Years_en _la_ciudad,Estado_civil,Product_Category_1,Product_Category_2,Product_Category_3,Imp_Compra
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [3]:
productos.head(5)

     Product                            Description average_product_rating
0  P00173842  Southpole® Allover Aztec Jogger Pants             1 out of 5
1  P00054442       a.n.a® Drape Front Jacket - Tall             1 out of 5
2  P00110042                 Bacova La Mer Bath Rug             1 out of 5
3  P00284342           Van Heusen® Pullover Sweater             1 out of 5
4  P00203242   Stylus™ Keyhole Hipster Swim Bottoms             1 out of 5

## Funcion .TAIL

### Muestra los ultimos elementos de la tabla

In [4]:
ventas.tail(5)

,User_ID,Product_ID,Sexo,Edad,Occupation,Cat_ciudad,Years_en _la_ciudad,Estado_civil,Product_Category_1,Product_Category_2,Product_Category_3,Imp_Compra
537572,1004737,P00193542,M,36-45,16,C,1,0,1,2.0,NaN,11664
537573,1004737,P00111142,M,36-45,16,C,1,0,1,15.0,16.0,19196
537574,1004737,P00345942,M,36-45,16,C,1,0,8,15.0,NaN,8043
537575,1004737,P00285842,M,36-45,16,C,1,0,5,NaN,NaN,7172
537576,1004737,P00118242,M,36-45,16,C,1,0,5,8.0,NaN,6875

## Funcion .SAMPLE

#### Muestra filas aleatorias de la muestra:

In [5]:
ventas.sample(5)

,User_ID,Product_ID,Sexo,Edad,Occupation,Cat_ciudad,Years_en _la_ciudad,Estado_civil,Product_Category_1,Product_Category_2,Product_Category_3,Imp_Compra
276260,1000594,P00360042,F,55+,13,B,3,0,8,NaN,NaN,10077
432821,1000655,P00161442,F,26-35,2,B,2,0,5,14.0,NaN,5241
423021,1005099,P00114942,M,18-25,0,B,3,0,1,15.0,16.0,15835
491167,1003669,P00182642,M,26-35,14,A,2,0,2,4.0,9.0,16361
485459,1002826,P00104942,M,36-45,12,A,4+,1,5,NaN,NaN,8706

# Funcion .UNIQUE

In [6]:
#Para ver los elementos dentro de una columna: UTILIZAMOS .UNIQUE


ventas.Sexo.unique()

array(['F', 'M'], dtype=object)

In [7]:
ventas.Cat_ciudad.unique()

array(['A', 'C', 'B'], dtype=object)

# Funcion VALUE_COUNTS

## Para contar elementos dentro de una columna

In [8]:
# Si queremos saber el numero total de Hombres y Mujeres: (Contar valores)


ventas.Sexo.value_counts()

M    405380
F    132197
Name: Sexo, dtype: int64

In [9]:
# Si queremos saber la poblacion por edad


ventas.Edad.value_counts()

26-35    214690
36-45    107499
18-25     97634
46-50     44526
51-55     37618
55+       20903
0-17      14707
Name: Edad, dtype: int64

In [10]:
# La Categoria de la ciudad


ventas.Cat_ciudad.value_counts()

B    226493
C    166446
A    144638
Name: Cat_ciudad, dtype: int64

# Funcion LEN(____)  

## Saber el numero de filas de una tabla

In [11]:
len(ventas)

537577

## Funcion .INDEX

In [12]:
# Nos indica el numero de filas que tiene la tabla. == funcion len

ventas.index

RangeIndex(start=0, stop=537577, step=1)

In [13]:
ventas.Edad.index

RangeIndex(start=0, stop=537577, step=1)

# Funcion .VALUES

In [14]:
ventas.values

array([[1000001, 'P00069042', 'F', ..., nan, nan, 8370],
       [1000001, 'P00248942', 'F', ..., 6.0, 14.0, 15200],
       [1000001, 'P00087842', 'F', ..., nan, nan, 1422],
       ...,
       [1004737, 'P00345942', 'M', ..., 15.0, nan, 8043],
       [1004737, 'P00285842', 'M', ..., nan, nan, 7172],
       [1004737, 'P00118242', 'M', ..., 8.0, nan, 6875]], dtype=object)

In [15]:
ventas.Sexo.values

array(['F', 'F', 'F', ..., 'M', 'M', 'M'], dtype=object)

In [16]:
ventas.Cat_ciudad.values

array(['A', 'A', 'A', ..., 'C', 'C', 'C'], dtype=object)

## Funcion.  .INFO()

Muestra info acerca del objeto DF (num de cols, num de filas, memoria usada..) e info relativa a cada una de las cols (nombre, tipo y numero de valores distintos de NaN)

In [17]:
ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
User_ID                537577 non-null int64
Product_ID             537577 non-null object
Sexo                   537577 non-null object
Edad                   537577 non-null object
Occupation             537577 non-null int64
Cat_ciudad             537577 non-null object
Years_en _la_ciudad    537577 non-null object
Estado_civil           537577 non-null int64
Product_Category_1     537577 non-null int64
Product_Category_2     370591 non-null float64
Product_Category_3     164278 non-null float64
Imp_Compra             537577 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

## Funcion DESCRIBE


### Para conocer los estadisticos de una columna o tabla

In [18]:
ventas.describe()

,User_ID,Occupation,Estado_civil,Product_Category_1,Product_Category_2,Product_Category_3,Imp_Compra
count,5.375770e+05,537577.00000,537577.000000,537577.000000,370591.000000,164278.000000,537577.000000
mean,1.002992e+06,8.08271,0.408797,5.295546,9.842144,12.669840,9333.859853
std,1.714393e+03,6.52412,0.491612,3.750701,5.087259,4.124341,4981.022133
min,1.000001e+06,0.00000,0.000000,1.000000,2.000000,3.000000,185.000000
25%,1.001495e+06,2.00000,0.000000,1.000000,5.000000,9.000000,5866.000000
50%,1.003031e+06,7.00000,0.000000,5.000000,9.000000,14.000000,8062.000000
75%,1.004417e+06,14.00000,1.000000,8.000000,15.000000,16.000000,12073.000000
max,1.006040e+06,20.00000,1.000000,18.000000,18.000000,18.000000,23961.000000

In [19]:
# Si queremos de una columna en particular:


round(ventas.Imp_Compra.describe(),2)

count    537577.00
mean       9333.86
std        4981.02
min         185.00
25%        5866.00
50%        8062.00
75%       12073.00
max       23961.00
Name: Imp_Compra, dtype: float64

# Media   --> Funcion MEAN

In [20]:
round(ventas.Imp_Compra.mean(),2)

9333.86

# Desviacion Tipica. --> Funcion STD

In [21]:
round(ventas.Imp_Compra.std(),2)

4981.02

# Minimo   --> min

In [22]:
ventas.Imp_Compra.min()

185

# Maximo   --> max

In [23]:
ventas.Imp_Compra.max()

23961

# Contar -->. Count

In [24]:
ventas.Imp_Compra.count()

537577

## Crear un dataframe seleccionando las siguientes columnas: "Sexo" "Cat_Ciudad" y "Imp_Compra"

In [25]:
cols = ["Sexo", "Cat_ciudad" , "Imp_Compra"]


tabla_2 = pd.DataFrame(ventas, columns = cols)


tabla_2.head(5)

  Sexo Cat_ciudad  Imp_Compra
0    F          A        8370
1    F          A       15200
2    F          A        1422
3    F          A        1057
4    M          C        7969

In [26]:
ventas.Cat_ciudad.value_counts()

B    226493
C    166446
A    144638
Name: Cat_ciudad, dtype: int64

# Eliminar NaN de una tabla


## Si hay un Nan en la fila, elimina la fila completa:

In [27]:
tabla_2 = tabla_2.dropna()

tabla_2.head()

  Sexo Cat_ciudad  Imp_Compra
0    F          A        8370
1    F          A       15200
2    F          A        1422
3    F          A        1057
4    M          C        7969

## Para eliminar NaN, si hay 2 o 3 o el numero que queramos de Nan por FILA

In [28]:
# En este caso si hay 3 o mas NaN en la fila eliminariamos la fila


tabla_2.dropna(thresh= 2, axis= 0)  # tener hasta 2 NaN como mucho

#thresh: Te dice que al menos tiene que haber ESA cantidad de valores distintos de NaN

       Sexo Cat_ciudad  Imp_Compra
0         F          A        8370
1         F          A       15200
2         F          A        1422
3         F          A        1057
4         M          C        7969
...     ...        ...         ...
537572    M          C       11664
537573    M          C       19196
537574    M          C        8043
537575    M          C        7172
537576    M          C        6875

[537577 rows x 3 columns]

In [29]:
tabla_2.Imp_Compra.mean()

9333.859852635065

## Queremos calcular la media, max y min   FILTRANDO POR CATEGORIA

In [30]:
## Por Sexo y Cat_ciudad


def media(variable):
    res = sum(variable)/len(variable)
    return res

resultados = tabla_2.groupby(["Sexo", "Cat_ciudad"]).agg([max,min,media])

resultados

                Imp_Compra
                       max  min         media
Sexo Cat_ciudad
F    A               23948  188   8630.771856
     B               23959  185   8590.518480
     C               23951  190   9264.964642
M    A               23961  185   9061.717739
     B               23960  185   9400.754481
     C               23961  186  10033.197730

In [31]:
# ENN DIFERENTE ORDEN....

def media(variable):
    res = sum(variable)/len(variable)
    return res

resultados = tabla_2.groupby([ "Cat_ciudad", "Sexo"]).agg([max,min,media])

resultados

                Imp_Compra
                       max  min         media
Cat_ciudad Sexo
A          F         23948  188   8630.771856
           M         23961  185   9061.717739
B          F         23959  185   8590.518480
           M         23960  185   9400.754481
C          F         23951  190   9264.964642
           M         23961  186  10033.197730

In [32]:

#Si queremos solo el minimo y maximo por categoria

resultados_2 = tabla_2.groupby([ "Sexo",  "Cat_ciudad"]).agg([max,min ])

resultados_2

                Imp_Compra
                       max  min
Sexo Cat_ciudad
F    A               23948  188
     B               23959  185
     C               23951  190
M    A               23961  185
     B               23960  185
     C               23961  186

# Correlacciones entre variables : Matriz de Correlacción.


## Para hacer la matriz de Corr deben ser todas las variables numericas, las que no sean numericas no las cogerá

In [33]:
# Creamos un dataframe nuevo con variables numericas

cols_2 = ["Imp_Compra","Occupation", "Estado_civil"]


tabla_3 = pd.DataFrame(ventas, columns = cols_2)


tabla_3.head(5)

   Imp_Compra  Occupation  Estado_civil
0        8370          10             0
1       15200          10             0
2        1422          10             0
3        1057          10             0
4        7969          16             0

In [34]:
# Matriz de Correlacion

matriz_corr = tabla_3.corr()

matriz_corr

              Imp_Compra  Occupation  Estado_civil
Imp_Compra      1.000000    0.021104      0.000129
Occupation      0.021104    1.000000      0.024691
Estado_civil    0.000129    0.024691      1.000000

# Calcular la Correlacion entre dos columnas:

In [35]:
Corr_Series = tabla_3["Imp_Compra"].corr(tabla_3["Occupation"])

round(Corr_Series,4)


#Comprobamos que es igual que en la matriz de Correlaciones.

0.0211

# Eliminar Columna en el Dataframe

In [36]:
# Creamos un dataframe nuevo

cols_3 = ["Sexo", "Occupation", "Cat_ciudad","Estado_civil","Imp_Compra", "Edad"]


new_data = pd.DataFrame(ventas, columns = cols_3)

new_data.head(5)

  Sexo  Occupation Cat_ciudad  Estado_civil  Imp_Compra  Edad
0    F          10          A             0        8370  0-17
1    F          10          A             0       15200  0-17
2    F          10          A             0        1422  0-17
3    F          10          A             0        1057  0-17
4    M          16          C             0        7969   55+

# Eliminar con POP, ESTE METODO LO ELIMINA DEL DATAFRAME

### En cambio drop no lo elimina del dataframe

In [37]:
# Para eliminar una columna "Edad"

new_data.pop("Edad")

new_data.head()


#Observamos que hemos eliminado la Columna Edad

  Sexo  Occupation Cat_ciudad  Estado_civil  Imp_Compra
0    F          10          A             0        8370
1    F          10          A             0       15200
2    F          10          A             0        1422
3    F          10          A             0        1057
4    M          16          C             0        7969

# Para crear una __COLUMNA NUEVA CALCULADA A PARTIR DE OTRAS COLUMNAS DEL DF__

In [38]:
new_data["IVA"] = new_data["Imp_Compra"] * 0.16

In [39]:
new_data.head(5)

  Sexo  Occupation Cat_ciudad  Estado_civil  Imp_Compra      IVA
0    F          10          A             0        8370  1339.20
1    F          10          A             0       15200  2432.00
2    F          10          A             0        1422   227.52
3    F          10          A             0        1057   169.12
4    M          16          C             0        7969  1275.04

In [40]:
new_data["Importe_Sin_IVA"] = new_data["Imp_Compra"] - new_data["IVA"]

new_data.head(3)

,Sexo,Occupation,Cat_ciudad,Estado_civil,Imp_Compra,IVA,Importe_Sin_IVA
0,F,10,A,0,8370,1339.20,7030.80
1,F,10,A,0,15200,2432.00,12768.00
2,F,10,A,0,1422,227.52,1194.48

# Crear Columnas con IF / ELIF  -->>  CON CONDICIONALES

In [41]:


clase = new_data

def cambio_nombre(columna):
    if columna == "A":
        return  "Clase Alta"
    elif columna == "B":
        return  "Clase Media"
    elif columna == "C":
        return "Clase Baja"
    
    
clase["Clase_social"] =  clase.Cat_ciudad.apply(cambio_nombre)


clase.head(6)

,Sexo,Occupation,Cat_ciudad,Estado_civil,Imp_Compra,IVA,Importe_Sin_IVA,Clase_social
0,F,10,A,0,8370,1339.20,7030.80,Clase Alta
1,F,10,A,0,15200,2432.00,12768.00,Clase Alta
2,F,10,A,0,1422,227.52,1194.48,Clase Alta
3,F,10,A,0,1057,169.12,887.88,Clase Alta
4,M,16,C,0,7969,1275.04,6693.96,Clase Baja
5,M,15,A,0,15227,2436.32,12790.68,Clase Alta

In [42]:
estado = clase


def cambio_nombre(columna):
    if columna == 0:
        return "Soltero"
    elif columna == 1:
        return "Casado"
    
estado["Categoria"]= estado.Estado_civil.apply(cambio_nombre)

estado.sample(10)

,Sexo,Occupation,Cat_ciudad,Estado_civil,Imp_Compra,IVA,Importe_Sin_IVA,Clase_social,Categoria
366138,F,0,C,1,12084,1933.44,10150.56,Clase Baja,Casado
39678,F,3,C,0,10052,1608.32,8443.68,Clase Baja,Soltero
234234,M,18,C,0,6055,968.80,5086.20,Clase Baja,Soltero
160824,M,20,A,0,5202,832.32,4369.68,Clase Alta,Soltero
504901,M,12,B,1,15564,2490.24,13073.76,Clase Media,Casado
454558,F,2,C,1,8374,1339.84,7034.16,Clase Baja,Casado
296408,M,5,C,1,8702,1392.32,7309.68,Clase Baja,Casado
105344,M,19,A,0,7131,1140.96,5990.04,Clase Alta,Soltero
192292,M,4,B,0,8673,1387.68,7285.32,Clase Media,Soltero
481223,F,1,B,0,16154,2584.64,13569.36,Clase Media,Soltero

# Grupos y operaciones de agregacion -->>  GROUPBY

__Despues de importar datos y procesarlos__, una de las tareas mas habituales el la agrupacion de datos __por alguna caracteristica__ oara realizar operaciones sobre cada uno de los grupos obtenidos. 
- Se realiza en un unico paso: __GROUPBY__ de DF : similar a group by en SQL

#### La operacion GROUP BY
1. Los datos se dividen en grupos basados en caracteristicas
    - Ej: es posible hacer __grupos por filas__ (axis = 0) o __por columnas__ (axis = 1)
2. Tras crear los grupos se puede realizar __alguna operacion__ 
    - Ej: operaciones __De agregacion__ u
    - operaciones de __transformacion__ (a cada uno de los grupos y se __obtiene una SERIE para cada grupo__
3. Se aplica la funcion (o predefinida en el paquete o creada por el usuario) a __cada uno de los grupos__
4. Resultado: __VALOR__ para __cada uno de los grupos__

In [43]:

estado.groupby(["Categoria","Clase_social"]).Clase_social.count()

Categoria  Clase_social
Casado     Clase Alta       55250
           Clase Baja       72230
           Clase Media      92280
Soltero    Clase Alta       89388
           Clase Baja       94216
           Clase Media     134213
Name: Clase_social, dtype: int64

In [44]:
estado.groupby(["Clase_social","Categoria"]).Categoria.count()

Clase_social  Categoria
Clase Alta    Casado        55250
              Soltero       89388
Clase Baja    Casado        72230
              Soltero       94216
Clase Media   Casado        92280
              Soltero      134213
Name: Categoria, dtype: int64

In [45]:
estado.groupby(["Categoria", "Clase_social"]).Imp_Compra.mean()

Categoria  Clase_social
Casado     Clase Alta      8855.717756
           Clase Baja      9862.775149
           Clase Media     9207.978143
Soltero    Clase Alta      9021.237649
           Clase Baja      9830.386771
           Clase Media     9192.249551
Name: Imp_Compra, dtype: float64

# Groupby más estetico.

In [46]:
round(estado.groupby([ "Clase_social","Categoria"]).Imp_Compra.mean().unstack(),2)

Categoria      Casado  Soltero
Clase_social
Clase Alta    8855.72  9021.24
Clase Baja    9862.78  9830.39
Clase Media   9207.98  9192.25

## Combinar dataframes:  Funcion MERGE

Cuando la informacion está distribuida en __VARIOS DF__ antes de analizarlos hay que __COMBINARLOS__ para crear nuevos __DF__ con toda la info necesaria. 

Herramientas para combinar DF:

##### 1. Combinar tablas al estilo del ALGEBRA RELACIONAL

Con la funcion (`pd.merge`) se pueden combinar __FILAS__ de 2 DF a partir del valor de __UNA O VARIAS COLUMNAS__
(Es como __join__ al estilo algebra relacional__

- Las __COLUMNAS DE COMBINACION__ se indican mediante una __LISTA__ en el argumento (`on`) de la funcion.
- En el argumento (`how`) de pd.merge indicamos el tipo de combinacion que queremos hacer : (`left, right, outer, inner`) 
 > RESULTADO: NUEVO DATAFRAME (DF)